#include <stdio.h>
int main() 
{                   
    float a = 0.617;                                // float ประกาศตัวแปร a
    printf("a=%6.3f%%\n",a) ;                      // แสดงผลตัวแปร a ในรูปแบบทศนิยม 3 ตำแหน่ง   

    int b = 25;                                     // int ประกาศตัวแปร b
    printf("b=%4d%%\n", b);                        // แสดงผลตัวแปร b ในรูปแบบจำนวนเต็ม 6 หลัก

    float c = 19.0;                   // float ประกาศตัวแปร c
    printf("c =%6.3f%%\n", c);       // แสดงผลตัวแปร c ในรูปแบบทศนิยม 2 ตำแหน่ง

    int d = 9;                        // int ประกาศตัวแปร d
    printf("d  =%-2d%%\n", d);       // แสดงผลตัวแปร d ในรูปแบบจำนวนเต็ม 4 หลัก

    float  e = 124.555;              // float ประกาศตัวแปร e
    printf("e=%7.3f%%\n", e);       // แสดงผลตัวแปร e ในรูปแบบทศนิยม 3 ตำแหน่ง

    float f= 0.001;                  // float ประกาศตัวแปร f
    printf("f=%5.3f%%\n", f);       // แสดงผลตัวแปร f ในรูปแบบทศนิยม 3 ตำแหน่ง

    return 0; 
}